# Handling Missing Data with Pandas

In [2]:
import numpy as np
import pandas as pd

Pandas utiliy functions

Similarly to numpy, pandas also has a few utility functions to identify and detect null values

In [3]:
pd.isnull(np.nan)

True

In [4]:
pd.isnull(None)

True

In [5]:
pd.isna(np.nan)

True

In [6]:
pd.isna(None)

True

Not a null value

In [7]:
pd.notnull(None)

False

In [8]:
pd.notnull(np.nan)

False

In [9]:
pd.notnull(3)

True

In [10]:
pd.isnull(pd.Series([1, np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [11]:
pd.notnull(pd.Series([1, np.nan, 7]))

0     True
1    False
2     True
dtype: bool

In [12]:
pd.isnull(pd.DataFrame({
    'Column A': [1, np.nan, 7],
    'Column B': [np.nan, 2, 3],
    'Column C': [np.nan, 2, np.nan]
}))

   Column A  Column B  Column C
0     False      True      True
1      True     False     False
2     False     False      True

Pandas Operation with Missing Data

### Pandas manages missing values more gracefully than numpy, nan will no longer behave as visures and operations will just ignore them completely:

In [13]:
pd.Series([1,2,np.nan]).count()

pd.Series([1,2,np.nan]).sum()

pd.Series([2,2,np.nan]).mean()

2.0

Filering Missing Data

In [14]:
s = pd.Series([1,2,3,np.nan, np.nan, 4])

In [15]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [16]:
pd.notnull(s).count()

6

In [17]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [18]:
s[pd.isnull(s)]

3   NaN
4   NaN
dtype: float64

Dropping null values

We can dropna to drop null values

In [21]:
s.dropna(inplace=True)

In [22]:
s

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

Dropping null values on DataFrames

In [23]:
df = pd.DataFrame({
    'Column A': [1,np.nan, 30, np.nan],
    'Column B': [2,8,31, np.nan],
    'Column C': [np.nan, 9, 32, 100],
    'Column D': [5,8,34,110]
})

In [29]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [24]:
df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [25]:
df.isnull().sum()

Column A    2
Column B    1
Column C    1
Column D    0
dtype: int64

In [26]:
df.shape

(4, 4)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  2 non-null      float64
 1   Column B  3 non-null      float64
 2   Column C  3 non-null      float64
 3   Column D  4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [28]:
df.dropna()

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [30]:
df.dropna(axis=1) ### axis column also work

   Column D
0         5
1         8
2        34
3       110

In above cases the dropna removes drops any row or  column if it contains one null value. We can control this behavior by #how parameter

In [31]:
df2 = pd.DataFrame({
    'Column A': [1,np.nan,30],
    'Column B': [2, np.nan, 31],
    'Column C': [np.nan, np.nan, 100]
})

In [32]:
df2

   Column A  Column B  Column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [35]:
### Dropna with how parameter
df2.dropna(how='all')

   Column A  Column B  Column C
0       1.0       2.0       NaN
2      30.0      31.0     100.0

In [36]:
df.dropna(how='any')

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

You can also use thresh parameter to indicate a threshold (a minimum number) of non-null values for the row/column to be kept

In [37]:
df.dropna(thresh =3)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34

In [38]:
df.dropna(thresh=3, axis='columns')

   Column B  Column C  Column D
0       2.0       NaN         5
1       8.0       9.0         8
2      31.0      32.0        34
3       NaN     100.0       110

Filling null values

In [41]:
x = pd.Series([1,2,3,np.nan, np.nan, 4])
x

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [42]:
x.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [43]:
x.fillna(x.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [44]:
x

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

Filling nulls with contiguous (close) values

The method argument is used to fill null values with other values close to that null one.

In [49]:
# x.fillna(method = 'ffill')
x.ffill()
### Use the last value and fill next null values

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [51]:
x.bfill()
# Take the values post null and paste backward to null

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

In [52]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [53]:
df.fillna({'Column A': 0, 'Column B': 99, 'Column C': df['Column C'].mean()})

   Column A  Column B  Column C  Column D
0       1.0       2.0      47.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0      99.0     100.0       110

In [57]:
df.ffill(axis=0) ### Vertical filling

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       1.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      30.0      31.0     100.0       110

In [56]:
df.bfill(axis=1) ## Horizontal filling

   Column A  Column B  Column C  Column D
0       1.0       2.0       5.0       5.0
1       8.0       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3     100.0     100.0     100.0     110.0

Checking if there are NAs

The question is: Does this Series or DataFrame contain any missing value? The answer should be yes or no: True or False. How can you verify it

In [60]:
## Example 1: Checking the length
s.dropna().count()

4